Revit 2026 API

# UIControlledApplicationRegisterDockablePane Method

---
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RegisterDockablePane(
	DockablePaneId id,
	string title,
	IDockablePaneProvider provider
)
```
```vb
Public Sub RegisterDockablePane (
	id As DockablePaneId,
	title As String,
	provider As IDockablePaneProvider
)
```
```cpp
public:
void RegisterDockablePane(
	DockablePaneId^ id,
	String^ title,
	IDockablePaneProvider^ provider
)
```
```fsharp
member RegisterDockablePane :
        id : DockablePaneId *
        title : string *
        provider : IDockablePaneProvider -> unit
```

#### Parameters

id DockablePaneId

title String

provider IDockablePaneProvider

#### Reference

UIControlledApplication Class

Autodesk.Revit.UI Namespace